# Energy Analysis Zone Dehumidification Set Point Property

Source: https://www.revitapidocs.com/2026/718e1d58-f2fb-f059-3d7f-ff3761b71629.htm

---

| Energy Analysis Zone Dehumidification Set Point Property |
| --- |

The dehumidification set point as a number between 0 and 1\.
**Namespace:** Autodesk.Revit.DB.Analysis
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public double DehumidificationSetPoint { get; }
```

```
Public ReadOnly Property DehumidificationSetPoint As Double
	Get
```

```
public:
property double DehumidificationSetPoint {
	double get ();
}
```

```
member DehumidificationSetPoint : float with get
```

#### Property Value

Double See Also

#### Reference

EnergyAnalysisZone Class Autodesk.Revit.DB.Analysis Namespace